from roman import Roman
 
# Пример использования
if __name__ == "__main__":
    r1 = Roman("X")  # Римское число X (10)
    r2 = Roman(5)    # Арабское число 5 (V)

    print("       Числа:", r1, r2, r1.arabic, r2.arabic)
    # Результат: Числа: X V 10 5

    print("       Сумма:", r1 + r2)  # 10 + 5 = 15 (XV)
    # Результат: Сумма: XV

    print("    Разность:", r1 - r2)  # 10 - 5 = 5 (V)
    # Результат: Разность: V

    print("Произведение:", r1 * r2)  # 10 * 5 = 50 (L)
    # Результат: Произведение: L

    print("     Частное:", r1 // r2)  # 10 // 5 = 2 (II)
    # Результат: Частное: II

    print("\nПреобразование без создания объекта:")
    print(2016, "=", Roman.to_roman(2016))  # 2016 = MMXVI
    # Результат: 2016 = MMXVI

    print("MMXVI", "=", Roman.to_arabic("MMXVI"))  # MMXVI = 2016
    # Результат: MMXVI = 2016